yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/nfi_reg.h
 * |[0]     |WP        |NAND Flash Write Protect Control
 * |        |          |Set this bit low (low active) to make NAND_nWP functional pin low to prevent the write to NAND Flash device.
 * |        |          |0 = NAND Flash is write-protected and is not writeable.
 * |        |          |1 = NAND Flash is not write-protected and is writeable.
 * @var NFI_T::NANDECCES
 * Offset: 0x8D0  NAND Flash ECC Error Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |F1STAT    |ECC Status of Field 1
 * |        |          |This field contains the ECC correction status (BCH algorithm) of ECC-field 1.
 * |        |          |00 = No error.
 * |        |          |01 = Correctable error.
 * |        |          |10 = Uncorrectable error.
 * |        |          |11 = Reserved.
 * |[6:2]   |F1ECNT    |Error Count of ECC Field 1
 * |        |          |This field contains the error counts after ECC correct calculation of Field 1
 * |        |          |For this ECC core (BCH algorithm), only when F1STAT equals to 0x01, the value in this field is meaningful
 * |        |          |F1ECNT means how many errors depending on which ECC is used.
 * |[9:8]   |F2STAT    |ECC Status of Field 2
 * |        |          |This field contains the ECC correction status (BCH algorithm) of ECC-field 2.
 * |        |          |00 = No error.
 * |        |          |01 = Correctable error.
 * |        |          |10 = Uncorrectable error.
 * |        |          |11 = Reserved.
 * |[14:10] |F2ECNT    |Error Count of ECC Field 2
 * |        |          |This field contains the error counts after ECC correct calculation of Field 2
 * |        |          |For this ECC core (BCH algorithm), only when F2STAT equals to 0x01, the value in this field is meaningful
 * |        |          |F2ECNT means how many errors depending on which ECC is used.
 * |[17:16] |F3STAT    |ECC Status of Field 3
 * |        |          |This field contains the ECC correction status (BCH algorithm) of ECC-field 3.
 * |        |          |00 = No error.
 * |        |          |01 = Correctable error.
 * |        |          |10 = Uncorrectable error.
 * |        |          |11 = Reserved.
 * |[22:18] |F3ECNT    |Error Count of ECC Field 3
 * |        |          |This field contains the error counts after ECC correct calculation of Field 3
 * |        |          |For this ECC core (BCH algorithm), only when F3STAT equals to 0x01, the value in this field is meaningful
 * |        |          |F3ECNT means how many errors depending on which ECC is used.
 * |[25:24] |F4STAT    |ECC Status of Field 4
 * |        |          |This field contains the ECC correction status (BCH algorithm) of ECC-field 4.
 * |        |          |00 = No error.
 * |        |          |01 = Correctable error.
 * |        |          |10 = Uncorrectable error.
 * |        |          |11 = Reserved.
 * |[30:26] |F4ECNT    |Error Count of ECC Field 4
 * |        |          |This field contains the error counts after ECC correct calculation of Field 4
 * |        |          |For this ECC core (BCH algorithm), only when F4STAT equals to 0x01, the value in this field is meaningful
 * |        |          |F4ECNT means how many errors depending on which ECC is used.
 * @var NFI_T::NANDECCEA
 * Offset: 0x900  NAND Flash ECC Error Byte Address 0 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10:0]  |ERRADDR0  |ECC Error Address First Field of Error 0
 * |        |          |This field contains an 11-bit ECC error address 0 of first field
 * |        |          |If it is a correctable error, please read the error data, ERRDATA0 (NFI_NANDECCED0[7:0]), to correct this error.
 * |[26:16] |ERRADDR1  |ECC Error Address First Field of Error 1
 * |        |          |This field contains an 11-bit ECC error address 1 of first field
 * |        |          |If it is a correctable error, please read the error data, ERRDATA1 (NFI_NANDECCED0[15:8]), to correct this error.
 * @var NFI_T::NANDECCED
 * Offset: 0x960  NAND Flash ECC Error Data Register 
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |ERRDATA0  |ECC Error Data of First Field 0
 * |        |          |This field contains an 8-bit BCH ECC error data 0 of first field
 * |        |          |If it is a correctable error, please read out the error data in this field and doing bitwise XOR with received data locating at address ERRADDR0 (NFI_ANNDECCEA0[10:0]), and then the result will be the correct data.
 * |[15:8]  |ERRDATA1  |ECC Error Data of First Field 1
 * |        |          |This field contains an 8-bit BCH ECC error data 1 of first field
 * |        |          |If it is a correctable error, please read out the error data in this field and doing bitwise XOR with received data locating at address ERRADDR1 (NFI_NANDECCEA0[26:16]), and then the result will be the correct data.
 * |[23:16] |ERRDATA2  |ECC Error Data of First Field 2
 * |        |          |This field contains an 8-bit BCH ECC error data 2 of first field
 * |        |          |If it is a correctable error, please read out the error data in this field and doing bitwise XOR with received data locating at address ERRADDR2 (NFI_NANDECCEA1[10:0]), and then the result will be the correct data.
 * |[31:24] |ERRDATA3  |ECC Error Data of First Field 3
 * |        |          |This field contains an 8-bit BCH ECC error data 3 of first field
 * |        |          |If it is a correctable error, please read out the error data in this field and doing bitwise XOR with received data locating at address ERRADDR3 (NFI_NANDECCEA1[26:16]), and then the result will be the correct data.
 * @var NFI_T::NANDRA
 * Offset: 0xA00  NAND Flash Redundant Area Word n
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |Data      |NAND Flash Redundant Area Word n
 * |        |          |This field indicates a 32-bit data of redundant area.
 */
    __IO uint32_t BUFFER[32];            /*!< [0x0000] NFI Embedded Buffer Word n                                       */
    __I  uint32_t RESERVE0[224];
    __IO uint32_t DMACTL;                /*!< [0x0400] NFI DMA Control and Status Register                              */
    __I  uint32_t RESERVE1[1];
    __IO uint32_t DMASA;                 /*!< [0x0408] NFI DMA Transfer Starting Address Register                       */
    __I  uint32_t DMABCNT;               /*!< [0x040c] NFI DMA Transfer Byte Count Register                             */
    __IO uint32_t DMAINTEN;              /*!< [0x0410] NFI DMA Interrupt Enable Control Register                        */
    __I  uint32_t DMAINTSTS;             /*!< [0x0414] NFI DMA Interrupt Status Register                                */
    __I  uint32_t RESERVE2[250];
    __IO uint32_t GCTL;                  /*!< [0x0800] NFI Global Control and Status Register                           */
    __IO uint32_t GINTEN;                /*!< [0x0804] NFI Global Interrupt Control Register                            */
    __I  uint32_t GINTSTS;               /*!< [0x0808] NFI Global Interrupt Status Register                             */
    __I  uint32_t RESERVE3[37];
    __IO uint32_t NANDCTL;               /*!< [0x08a0] NAND Flash Control Register                                      */
    __IO uint32_t NANDTMCTL;             /*!< [0x08a4] NAND Flash Timing Control Register                               */
    __IO uint32_t NANDINTEN;             /*!< [0x08a8] NAND Flash Interrupt Enable Register                             */
    __IO uint32_t NANDINTSTS;            /*!< [0x08ac] NAND Flash Interrupt Status Register                             */
    __O  uint32_t NANDCMD;               /*!< [0x08b0] NAND Flash Command Port Register                                 */
    __O  uint32_t NANDADDR;              /*!< [0x08b4] NAND Flash Address Port Register                                 */
    __IO uint32_t NANDDATA;              /*!< [0x08b8] NAND Flash Data Port Register                                    */
    __IO uint32_t NANDRACTL;             /*!< [0x08bc] NAND Flash Redundant Area Control Register                       */
    __IO uint32_t NANDECTL;              /*!< [0x08c0] NAND Flash Extend Control Register                               */
    __I  uint32_t RESERVE4[3];
    __I  uint32_t NANDECCES[4];          /*!< [0x08d0] NAND Flash ECC Error Status 0 Register                           */
    __I  uint32_t RESERVE5[8];
    __I  uint32_t NANDECCEA[12];         /*!< [0x0900] NAND Flash ECC Error Byte Address 0 Register                     */
    __I  uint32_t RESERVE6[12];
    __I  uint32_t NANDECCED[6];          /*!< [0x0960] NAND Flash ECC Error Data Register 0                             */
    __I  uint32_t RESERVE7[34];
    __IO uint32_t NANDRA[118];           /*!< [0x0a00] NAND Flash Redundant Area Word n                                 */

} NFI_T;

/**
    @addtogroup NFI_CONST NFI Bit Field Definition
    Constant Definitions for NFI Controller
@{ */

