yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/nfi_reg.h
#define NFI_BUFFER_Data_Pos              (0)                                               /*!< NFI_T::BUFFER: Data Position           */
#define NFI_BUFFER_Data_Msk              (0xfffffffful << NFI_BUFFER0_Data_Pos)            /*!< NFI_T::BUFFER: Data Mask               */

#define NFI_DMACTL_DMACEN_Pos            (0)                                               /*!< NFI_T::DMACTL: DMACEN Position         */
#define NFI_DMACTL_DMACEN_Msk            (0x1ul << NFI_DMACTL_DMACEN_Pos)                  /*!< NFI_T::DMACTL: DMACEN Mask             */

#define NFI_DMACTL_DMARST_Pos            (1)                                               /*!< NFI_T::DMACTL: DMARST Position         */
#define NFI_DMACTL_DMARST_Msk            (0x1ul << NFI_DMACTL_DMARST_Pos)                  /*!< NFI_T::DMACTL: DMARST Mask             */

#define NFI_DMACTL_SGEN_Pos              (3)                                               /*!< NFI_T::DMACTL: SGEN Position           */
#define NFI_DMACTL_SGEN_Msk              (0x1ul << NFI_DMACTL_SGEN_Pos)                    /*!< NFI_T::DMACTL: SGEN Mask               */

#define NFI_DMACTL_DMABUSY_Pos           (9)                                               /*!< NFI_T::DMACTL: DMABUSY Position        */
#define NFI_DMACTL_DMABUSY_Msk           (0x1ul << NFI_DMACTL_DMABUSY_Pos)                 /*!< NFI_T::DMACTL: DMABUSY Mask            */

#define NFI_DMASA_ORDER_Pos              (0)                                               /*!< NFI_T::DMASA: ORDER Position           */
#define NFI_DMASA_ORDER_Msk              (0x1ul << NFI_DMASA_ORDER_Pos)                    /*!< NFI_T::DMASA: ORDER Mask               */

#define NFI_DMASA_DMASA_Pos              (1)                                               /*!< NFI_T::DMASA: DMASA Position           */
#define NFI_DMASA_DMASA_Msk              (0x7ffffffful << NFI_DMASA_DMASA_Pos)             /*!< NFI_T::DMASA: DMASA Mask               */

#define NFI_DMABCNT_BCNT_Pos             (0)                                               /*!< NFI_T::DMABCNT: BCNT Position          */
#define NFI_DMABCNT_BCNT_Msk             (0xffffful << NFI_DMABCNT_BCNT_Pos)               /*!< NFI_T::DMABCNT: BCNT Mask              */

#define NFI_DMAINTEN_ABORTIEN_Pos        (0)                                               /*!< NFI_T::DMAINTEN: ABORTIEN Position     */
#define NFI_DMAINTEN_ABORTIEN_Msk        (0x1ul << NFI_DMAINTEN_ABORTIEN_Pos)              /*!< NFI_T::DMAINTEN: ABORTIEN Mask         */

#define NFI_DMAINTEN_WEOTIEN_Pos         (1)                                               /*!< NFI_T::DMAINTEN: WEOTIEN Position      */
#define NFI_DMAINTEN_WEOTIEN_Msk         (0x1ul << NFI_DMAINTEN_WEOTIEN_Pos)               /*!< NFI_T::DMAINTEN: WEOTIEN Mask          */

#define NFI_DMAINTSTS_ABORTIF_Pos        (0)                                               /*!< NFI_T::DMAINTSTS: ABORTIF Position     */
#define NFI_DMAINTSTS_ABORTIF_Msk        (0x1ul << NFI_DMAINTSTS_ABORTIF_Pos)              /*!< NFI_T::DMAINTSTS: ABORTIF Mask         */

#define NFI_DMAINTSTS_WEOTIF_Pos         (1)                                               /*!< NFI_T::DMAINTSTS: WEOTIF Position      */
#define NFI_DMAINTSTS_WEOTIF_Msk         (0x1ul << NFI_DMAINTSTS_WEOTIF_Pos)               /*!< NFI_T::DMAINTSTS: WEOTIF Mask          */

#define NFI_GCTL_GCTLRST_Pos             (0)                                               /*!< NFI_T::GCTL: GCTLRST Position          */
#define NFI_GCTL_GCTLRST_Msk             (0x1ul << NFI_GCTL_GCTLRST_Pos)                   /*!< NFI_T::GCTL: GCTLRST Mask              */

#define NFI_GCTL_NANDEN_Pos              (3)                                               /*!< NFI_T::GCTL: NANDEN Position           */
#define NFI_GCTL_NANDEN_Msk              (0x1ul << NFI_GCTL_NANDEN_Pos)                    /*!< NFI_T::GCTL: NANDEN Mask               */

#define NFI_GINTEN_DTAIEN_Pos            (0)                                               /*!< NFI_T::GINTEN: DTAIEN Position         */
#define NFI_GINTEN_DTAIEN_Msk            (0x1ul << NFI_GINTEN_DTAIEN_Pos)                  /*!< NFI_T::GINTEN: DTAIEN Mask             */

#define NFI_GINTSTS_DTAIF_Pos            (0)                                               /*!< NFI_T::GINTSTS: DTAIF Position         */
#define NFI_GINTSTS_DTAIF_Msk            (0x1ul << NFI_GINTSTS_DTAIF_Pos)                  /*!< NFI_T::GINTSTS: DTAIF Mask             */

#define NFI_NANDCTL_SWRST_Pos            (0)                                               /*!< NFI_T::NANDCTL: SWRST Position         */
#define NFI_NANDCTL_SWRST_Msk            (0x1ul << NFI_NANDCTL_SWRST_Pos)                  /*!< NFI_T::NANDCTL: SWRST Mask             */

#define NFI_NANDCTL_DRDEN_Pos            (1)                                               /*!< NFI_T::NANDCTL: DRDEN Position         */
#define NFI_NANDCTL_DRDEN_Msk            (0x1ul << NFI_NANDCTL_DRDEN_Pos)                  /*!< NFI_T::NANDCTL: DRDEN Mask             */

#define NFI_NANDCTL_DWREN_Pos            (2)                                               /*!< NFI_T::NANDCTL: DWREN Position         */
#define NFI_NANDCTL_DWREN_Msk            (0x1ul << NFI_NANDCTL_DWREN_Pos)                  /*!< NFI_T::NANDCTL: DWREN Mask             */

#define NFI_NANDCTL_REDUNREN_Pos         (3)                                               /*!< NFI_T::NANDCTL: REDUNREN Position      */
#define NFI_NANDCTL_REDUNREN_Msk         (0x1ul << NFI_NANDCTL_REDUNREN_Pos)               /*!< NFI_T::NANDCTL: REDUNREN Mask          */

#define NFI_NANDCTL_REDUNAUTOWEN_Pos     (4)                                               /*!< NFI_T::NANDCTL: REDUNAUTOWEN Position  */
#define NFI_NANDCTL_REDUNAUTOWEN_Msk     (0x1ul << NFI_NANDCTL_REDUNAUTOWEN_Pos)           /*!< NFI_T::NANDCTL: REDUNAUTOWEN Mask      */

#define NFI_NANDCTL_ECCCHK_Pos           (7)                                               /*!< NFI_T::NANDCTL: ECCCHK Position        */
#define NFI_NANDCTL_ECCCHK_Msk           (0x1ul << NFI_NANDCTL_ECCCHK_Pos)                 /*!< NFI_T::NANDCTL: ECCCHK Mask            */

#define NFI_NANDCTL_PROT3BEN_Pos         (8)                                               /*!< NFI_T::NANDCTL: PROT3BEN Position      */
#define NFI_NANDCTL_PROT3BEN_Msk         (0x1ul << NFI_NANDCTL_PROT3BEN_Pos)               /*!< NFI_T::NANDCTL: PROT3BEN Mask          */

#define NFI_NANDCTL_SRAMINT_Pos          (9)                                               /*!< NFI_T::NANDCTL: SRAMINT Position       */
#define NFI_NANDCTL_SRAMINT_Msk          (0x1ul << NFI_NANDCTL_SRAMINT_Pos)                /*!< NFI_T::NANDCTL: SRAMINT Mask           */

#define NFI_NANDCTL_PSIZE_Pos            (16)                                              /*!< NFI_T::NANDCTL: PSIZE Position         */
#define NFI_NANDCTL_PSIZE_Msk            (0x3ul << NFI_NANDCTL_PSIZE_Pos)                  /*!< NFI_T::NANDCTL: PSIZE Mask             */

#define NFI_NANDCTL_BCHTSEL_Pos          (18)                                              /*!< NFI_T::NANDCTL: BCHTSEL Position       */
#define NFI_NANDCTL_BCHTSEL_Msk          (0x1ful << NFI_NANDCTL_BCHTSEL_Pos)               /*!< NFI_T::NANDCTL: BCHTSEL Mask           */

#define NFI_NANDCTL_ECCEN_Pos            (23)                                              /*!< NFI_T::NANDCTL: ECCEN Position         */
#define NFI_NANDCTL_ECCEN_Msk            (0x1ul << NFI_NANDCTL_ECCEN_Pos)                  /*!< NFI_T::NANDCTL: ECCEN Mask             */

