yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/nfi_reg.h
#define NFI_NANDCTL_CS0_Pos              (25)                                              /*!< NFI_T::NANDCTL: CS0 Position           */
#define NFI_NANDCTL_CS0_Msk              (0x1ul << NFI_NANDCTL_CS0_Pos)                    /*!< NFI_T::NANDCTL: CS0 Mask               */

#define NFI_NANDTMCTL_LOWID_Pos          (0)                                               /*!< NFI_T::NANDTMCTL: LOWID Position       */
#define NFI_NANDTMCTL_LOWID_Msk          (0xfful << NFI_NANDTMCTL_LOWID_Pos)               /*!< NFI_T::NANDTMCTL: LOWID Mask           */

#define NFI_NANDTMCTL_HIWID_Pos          (8)                                               /*!< NFI_T::NANDTMCTL: HIWID Position       */
#define NFI_NANDTMCTL_HIWID_Msk          (0xfful << NFI_NANDTMCTL_HIWID_Pos)               /*!< NFI_T::NANDTMCTL: HIWID Mask           */

#define NFI_NANDTMCTL_CALESH_Pos         (16)                                              /*!< NFI_T::NANDTMCTL: CALESH Position      */
#define NFI_NANDTMCTL_CALESH_Msk         (0x7ful << NFI_NANDTMCTL_CALESH_Pos)              /*!< NFI_T::NANDTMCTL: CALESH Mask          */

#define NFI_NANDTMCTL_EDOD_Pos           (24)                                              /*!< NFI_T::NANDTMCTL: EDOD Position        */
#define NFI_NANDTMCTL_EDOD_Msk           (0xful << NFI_NANDTMCTL_EDOD_Pos)                 /*!< NFI_T::NANDTMCTL: EDOD Mask            */

#define NFI_NANDTMCTL_EDOEN_Pos          (31)                                              /*!< NFI_T::NANDTMCTL: EDOEN Position       */
#define NFI_NANDTMCTL_EDOEN_Msk          (0x1ul << NFI_NANDTMCTL_EDOEN_Pos)                /*!< NFI_T::NANDTMCTL: EDOEN Mask           */

#define NFI_NANDINTEN_DMAIE_Pos          (0)                                               /*!< NFI_T::NANDINTEN: DMAIE Position       */
#define NFI_NANDINTEN_DMAIE_Msk          (0x1ul << NFI_NANDINTEN_DMAIE_Pos)                /*!< NFI_T::NANDINTEN: DMAIE Mask           */

#define NFI_NANDINTEN_ECCFLDIE_Pos       (2)                                               /*!< NFI_T::NANDINTEN: ECCFLDIE Position    */
#define NFI_NANDINTEN_ECCFLDIE_Msk       (0x1ul << NFI_NANDINTEN_ECCFLDIE_Pos)             /*!< NFI_T::NANDINTEN: ECCFLDIE Mask        */

#define NFI_NANDINTEN_RB0IE_Pos          (10)                                              /*!< NFI_T::NANDINTEN: RB0IE Position       */
#define NFI_NANDINTEN_RB0IE_Msk          (0x1ul << NFI_NANDINTEN_RB0IE_Pos)                /*!< NFI_T::NANDINTEN: RB0IE Mask           */

#define NFI_NANDINTSTS_DMAIF_Pos         (0)                                               /*!< NFI_T::NANDINTSTS: DMAIF Position      */
#define NFI_NANDINTSTS_DMAIF_Msk         (0x1ul << NFI_NANDINTSTS_DMAIF_Pos)               /*!< NFI_T::NANDINTSTS: DMAIF Mask          */

#define NFI_NANDINTSTS_ECCFLDIF_Pos      (2)                                               /*!< NFI_T::NANDINTSTS: ECCFLDIF Position   */
#define NFI_NANDINTSTS_ECCFLDIF_Msk      (0x1ul << NFI_NANDINTSTS_ECCFLDIF_Pos)            /*!< NFI_T::NANDINTSTS: ECCFLDIF Mask       */

#define NFI_NANDINTSTS_EDOF_Pos          (4)                                               /*!< NFI_T::NANDINTSTS: EDOF Position       */
#define NFI_NANDINTSTS_EDOF_Msk          (0x1ul << NFI_NANDINTSTS_EDOF_Pos)                /*!< NFI_T::NANDINTSTS: EDOF Mask           */

#define NFI_NANDINTSTS_RB0IF_Pos         (10)                                              /*!< NFI_T::NANDINTSTS: RB0IF Position      */
#define NFI_NANDINTSTS_RB0IF_Msk         (0x1ul << NFI_NANDINTSTS_RB0IF_Pos)               /*!< NFI_T::NANDINTSTS: RB0IF Mask          */

#define NFI_NANDINTSTS_RB0Status_Pos     (18)                                              /*!< NFI_T::NANDINTSTS: RB0Status Position  */
#define NFI_NANDINTSTS_RB0Status_Msk     (0x1ul << NFI_NANDINTSTS_RB0Status_Pos)           /*!< NFI_T::NANDINTSTS: RB0Status Mask      */

#define NFI_NANDCMD_COMMAND_Pos          (0)                                               /*!< NFI_T::NANDCMD: COMMAND Position       */
#define NFI_NANDCMD_COMMAND_Msk          (0xfful << NFI_NANDCMD_COMMAND_Pos)               /*!< NFI_T::NANDCMD: COMMAND Mask           */

#define NFI_NANDADDR_ADDRESS_Pos         (0)                                               /*!< NFI_T::NANDADDR: ADDRESS Position      */
#define NFI_NANDADDR_ADDRESS_Msk         (0xfful << NFI_NANDADDR_ADDRESS_Pos)              /*!< NFI_T::NANDADDR: ADDRESS Mask          */

#define NFI_NANDADDR_EOA_Pos             (31)                                              /*!< NFI_T::NANDADDR: EOA Position          */
#define NFI_NANDADDR_EOA_Msk             (0x1ul << NFI_NANDADDR_EOA_Pos)                   /*!< NFI_T::NANDADDR: EOA Mask              */

#define NFI_NANDDATA_DATA_Pos            (0)                                               /*!< NFI_T::NANDDATA: DATA Position         */
#define NFI_NANDDATA_DATA_Msk            (0xfful << NFI_NANDDATA_DATA_Pos)                 /*!< NFI_T::NANDDATA: DATA Mask             */

#define NFI_NANDRACTL_RA128EN_Pos        (0)                                               /*!< NFI_T::NANDRACTL: RA128EN Position     */
#define NFI_NANDRACTL_RA128EN_Msk        (0x1fful << NFI_NANDRACTL_RA128EN_Pos)            /*!< NFI_T::NANDRACTL: RA128EN Mask         */

#define NFI_NANDRACTL_MECC_Pos           (16)                                              /*!< NFI_T::NANDRACTL: MECC Position        */
#define NFI_NANDRACTL_MECC_Msk           (0xfffful << NFI_NANDRACTL_MECC_Pos)              /*!< NFI_T::NANDRACTL: MECC Mask            */

#define NFI_NANDECTL_WP_Pos              (0)                                               /*!< NFI_T::NANDECTL: WP Position           */
#define NFI_NANDECTL_WP_Msk              (0x1ul << NFI_NANDECTL_WP_Pos)                    /*!< NFI_T::NANDECTL: WP Mask               */

#define NFI_NANDECCES_F1STAT_Pos         (0)                                               /*!< NFI_T::NANDECCES: F1STAT Position      */
#define NFI_NANDECCES_F1STAT_Msk         (0x3ul << NFI_NANDECCES0_F1STAT_Pos)              /*!< NFI_T::NANDECCES: F1STAT Mask          */

#define NFI_NANDECCES_F1ECNT_Pos         (2)                                               /*!< NFI_T::NANDECCES: F1ECNT Position      */
#define NFI_NANDECCES_F1ECNT_Msk         (0x1ful << NFI_NANDECCES0_F1ECNT_Pos)             /*!< NFI_T::NANDECCES: F1ECNT Mask          */

