yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/nfi_reg.h
#define NFI_NANDECCES_F2STAT_Pos         (8)                                               /*!< NFI_T::NANDECCES: F2STAT Position      */
#define NFI_NANDECCES_F2STAT_Msk         (0x3ul << NFI_NANDECCES0_F2STAT_Pos)              /*!< NFI_T::NANDECCES: F2STAT Mask          */

#define NFI_NANDECCES_F2ECNT_Pos         (10)                                              /*!< NFI_T::NANDECCES: F2ECNT Position      */
#define NFI_NANDECCES_F2ECNT_Msk         (0x1ful << NFI_NANDECCES0_F2ECNT_Pos)             /*!< NFI_T::NANDECCES: F2ECNT Mask          */

#define NFI_NANDECCES_F3STAT_Pos         (16)                                              /*!< NFI_T::NANDECCES: F3STAT Position      */
#define NFI_NANDECCES_F3STAT_Msk         (0x3ul << NFI_NANDECCES0_F3STAT_Pos)              /*!< NFI_T::NANDECCES: F3STAT Mask          */

#define NFI_NANDECCES_F3ECNT_Pos         (18)                                              /*!< NFI_T::NANDECCES: F3ECNT Position      */
#define NFI_NANDECCES_F3ECNT_Msk         (0x1ful << NFI_NANDECCES0_F3ECNT_Pos)             /*!< NFI_T::NANDECCES: F3ECNT Mask          */

#define NFI_NANDECCES_F4STAT_Pos         (24)                                              /*!< NFI_T::NANDECCES: F4STAT Position      */
#define NFI_NANDECCES_F4STAT_Msk         (0x3ul << NFI_NANDECCES0_F4STAT_Pos)              /*!< NFI_T::NANDECCES: F4STAT Mask          */

#define NFI_NANDECCES_F4ECNT_Pos         (26)                                              /*!< NFI_T::NANDECCES: F4ECNT Position      */
#define NFI_NANDECCES_F4ECNT_Msk         (0x1ful << NFI_NANDECCES0_F4ECNT_Pos)             /*!< NFI_T::NANDECCES: F4ECNT Mask          */

#define NFI_NANDRA_Data_Pos              (0)                                               /*!< NFI_T::NANDRA: Data Position           */
#define NFI_NANDRA_Data_Msk              (0xfffffffful << NFI_NANDRA0_Data_Pos)            /*!< NFI_T::NANDRA: Data Mask               */

/**@}*/ /* NFI_CONST */
/**@}*/ /* end of NFI register group */


/**@}*/ /* end of REGISTER group */
